#开发操作系统：导论
本系列文章的目的是演示并指导从零开始的操作系统开发。

##这是关于什么的？
操作系统是一个非常复杂的课题，因此对系统是如何工作的学习会有一个非常棒的体验。这一系列文章的目的是从零开始指导有关操作系统开发的"黑科技"。无论你是不是想做你自己的操作系统，抑或是想学习它们是如何工作的，这一系列文章就是为你而写的！

##操作系统是什么？
操作系统为计算机提供了基本的功能，交互和体验。其基本目的是为使用创建一个可用的操作环境。
Windows， Linux 和 Macintosh 就是操作系统的例子。

##如果你从未有过编程经验的话...
计算机编程指设计和编写计算机可以加载和执行的软件或程序。操作系统被设计用来提供这个功能。
一个操作系统并不是一个单一的程序，而是一系列可以进行工作和相互通信的软件。这就是我所说的"操作环境"。
因为操作系统是一系列的软件，为了开发一个操作系统，我们必须要知道如何开发软件。这就是说，我们必须懂得计算机编程。
如果你之前从未编程的话，只需要看看以下的"要求"小节。这个部分包含了很多好的指导书目与文章来帮你学习用 C++ 与 80x86 汇编。

##要求
###C 语言的知识
对一门高级语言的使用，例如说 C ，能让操作系统开发变的更加容易。在操作系统开发中最常用的语言包括 C, C++ 和 Perl 。不要认为必须要使用这些语言；事实上，其他语言也是可以的。我甚至见过使用 FreeBASIC 来进行开发的！然而，使用更高级更抽象的编程语言来开发会使得长期运行变得困难。

C 和 C+。是最常见的，其中 C 是使用最广的。C ，作为一个中级的语言，不仅提供了高级的结构还提供了底层的细节来更接近汇编语言，也因此更接近操作系统。因为这个，使用 C 来开发操作系统是很简单的。这也是为什么它被广泛使用的主要原因：因为 C 语言最初就是为系统级的开发和嵌入式所设计的。
因为这个，我们将在操作系统的大多数部分使用 C 语言。
C 是一门复杂的编程语言，我们可以通过看一本书来获得大体的认知。如果你不了解 C 的话，向你推荐以下书目：
Learn C - A complete resource for a beginner
Cprogramming.com
Thinking in C++
我个人看的是最早的 The C++ Programming Language ，但这本已经被淘汰了。
